Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: You are wearing your shirt inside out.
hi: तुमने अपनी कमीज़ उलटी पहनी हुई है।

source: Are you for or against this?
hi: आप इसके हित में हैं या नहीं?

source: Are you the owner of this house?
hi: आप इस घर के मालिक हैं क्या?

source: What did you do yesterday?
hi: तुमने कल क्या किया?

source: You must help your mother.
hi: तुम्हे अपनी मां की मदद करनी चाहिए।

source: Do you like tea or coffee?
hi: आपको चाय पसंद है या कॉफ़ी?

source: Do you think we should import rice from the U.S.?
hi: क्या आपको लगता है कि हमे अम्रीका से चावल का आयात करना चाहिए?

source: You have two flowers.
hi: तुम्हारे पास दो फूल हैं।

source: How many books do you read a month?
hi: तुम एक महीने में कितनी किताबें पढ़ते हो?

source: What time do you go home?
hi: तुम किस समय घर जाती हो?

source: You say one thing and then act just the opposite.
hi: तुम बोलते एक बात हो और करते दूसरी।

source: What time did your friend go home?
hi: तुम्हारा दोस्त कितने बजे घर वापस गया था?

source: Your sister can not speak English.
hi: तुम्हारी बहन अंग्रेज़ी नहीं बोल सकती है।

source: It's your turn. Please come this way.
hi: तुम्हारी बारी है। इस तरफ़ आओ।

source: You are correct in your judgement.
hi: आप अपने निर्णय में सही हैं।

source: I feel like I'm being drawn into your eyes.
hi: मुझे लगता है कि मैं तुम्हारी आँखों में खिंचा जा रहा हूँ।

source: I'm not saying that your answers are always wrong.
hi: मैं यह नहीं कह रही हूँ कि तुम्हारे उत्तर हमेशा ग़लत होते हैं।

source: Let me know your address.
hi: मुझे अपना पता बतादेना।

source: What is your name?
hi: आपका नाम क्या है?

source: What's your older sister doing now?
hi: तुम्हारी दीदी अभी क्या कर रही है?

source: Tell me something about your country.
hi: आपके देश के बारे में कुछ बताइए।

source: Do people drink tea in your country?
hi: क्या आपके देश में लोग चाय पीते हैं?

source: What's your favorite food?
hi: तुम्हारा सबसे पसंदीता खाना कौनसा है?

source: Your plan requires a large amount of money.
hi: तुम्हारी योजना के लिए बहुत सारे पैसे की ज़रूरत है।

source: You should try to conquer your smoking habit.
hi: तुम्हें अपने सिगरेट पीने पर रोक लगाने की कोशिश करनी चाहिए।

source: I wish I could speak English like you.
hi: काश मैं आपकी तरह अंग्रेज़ी बोल पाता।

source: Please show me your notebook.
hi: मुझे अपनी कौपी दिखाईए।

source: Have your roses come out yet?
hi: तुम्हारे गुलाब खिल गए हैं क्या?

source: I am afraid I can't help you.
hi: मुझे अफसोस है कि मैं आपकी मदत नहीं कर सकता।

source: Is your father a teacher?
hi: क्या आपके पिताजी अध्यापक हैं?

source: I was scared that you might leave me.
hi: मुझे डर था कि तुम मुझे छोड़ दोगे।

source: Do you have any brothers?
hi: तुम्हारे कोई भाई हैं क्या?

source: I'd like to have a word with you.
hi: मैं तुमसे बात करना चाह्ता हूँ।

source: I will come with you.
hi: मैं तुम्हारे साथ आऊँगा।

source: You're a life saver.
hi: तुमने मेरी जान बचाली।

source: People of your age often have this problem.
hi: तुम्हारी उम्र के लोगों को अक्सर इस तरह की दिक्कत होती है।

source: If you act like a fool, you must be treated as such.
hi: अगर तुम मूर्ख की तरह व्यवहार करोगे तो तुम्हारे साथ मूर्ख की तरह का व्यवहार ही होगा।

source: I was disappointed that you didn't call.
hi: मैं निराश था कि तुमने फ़ोन नहीं किया।

source: Give up smoking if you want to live long.
hi: अगर लम्बी ज़िन्दगी जीना चाहते हो तो सिगरेट पीना छोड़ दो।

source: It's all the same to me whether you go or stay.
hi: तुम जाओ या रहो, मुझे कोई फ़र्क नहीं पड़ता।

source: It makes no difference to me whether you are rich or poor.
hi: तुम अमीर हो या ग़रीब, इससे मुझे कोई फ़र्क नहीं पड़ता।

source: Tell me what you are looking forward to.
hi: मुझे बताओ तुम किस चीज़ की आशा कर रहे हो।

source: There is no necessity for you to do that.
hi: तुम्हें वैसे करने की कोई ज़रूरत नहीं है।

source: How long has it been since you gave up teaching at that school?
hi: तुम्हे स्कूल में पढ़ाना छोड़े हुए कितना समय हो गया है?

source: I will help you in selecting the best from these clothes.
hi: मैं तुम्हें इनमें से सबसे अच्छे कपड़े चुनने में मदद करूँगी।

source: How much time do we have to finish this?
hi: हमारे पास इस काम को खतम करने के लिए कितना समय है?

source: The man who is standing there is my father.
hi: वहाँ पर खड़े हुए वे मेरे पिता हैं।

source: What will you be doing at this time tomorrow?
hi: तुम कल इस समय क्या कर रहे होगे?

source: Tomorrow is my birthday.
hi: कल मेरा जन्मदिन है।

source: As a light goes out, so a man dies.
hi: जैसे दीपक बुझता है, वैसे ही आदमी मरता है।

source: I'm sorry, my father is out.
hi: माफ़ कीजिएगा, मेरे पापा अभी घर पर नहीं हैं।

source: Nobody likes him, because he is always blowing his own horn.
hi: उसे कोई भी पसंद नहीं करता क्योंकि वह सारे टाईम अपनी बड़ाई करता रहता है।

source: I don't care what they say.
hi: वे जो मर्ज़ी कहें मुझे उससे कोई फ़र्क नहीं पड़ता।

source: Oh, I do wish I could go to France.
hi: ओह, काश मैं फ़्रान्स जा सकती!

source: A politician like that gets my goat.
hi: ऐसे नेताओं पर मुझे गुस्सा आता है।

source: A man like that gets on my nerves.
hi: उस तरह का आदमी मुझसे झिलता नहीं है।

source: Here comes the train!
hi: लो आ गई ट्रेन!

source: Oh, no! We're running out of gas.
hi: अरे नहीं! पेट्रोल खतम होने वाला है।

source: A is 5 times as long as B.
hi: A B से पाँचगुना लम्बा है।

source: I will be back by nine.
hi: मैं नौ बजे से पहले वापस आ जाऊँगा।

source: Come to my house at eight.
hi: मेरे घर आठ बजे आना।

source: Take this medicine every six hours.
hi: इस दवाई को हर छः घंटे लेना।

source: Please wait for five minutes.
hi: कृपया पाँच मिनट इंतेज़ार करें।

source: May comes after April.
hi: मई अप्रैल के बाद आता है।

source: Can you lend me 500 yen?
hi: तुम मुझे पाँच सौ येन उधार दे सकते हो क्या?

source: It is easy to add 5 to 10.
hi: पाँच से दस को जोड़ना बहुत आसान है।

source: Run in the 40 meters.
hi: ४० मीटर वाली में भागो।

source: It was not until three days after that I knew she had disappeared.
hi: मुझे तीन दिन बीतने के बाद ही पता चला कि वह लापता थी।

source: Three men broke out of prison yesterday.
hi: कल तीन आदमी जेल से भाग गए।

source: I'll be staying here for three months.
hi: मैं यहाँ तीन महीनों के लिए रहूँगा।

source: Please come again two weeks from today.
hi: आज से दो हफ़्तों के बाद फिरसे आईएगा।

source: It will go away by itself in two weeks.
hi: वह दो हफ़्तों में अपने-आप चला जाएगा।

source: Out of the students, only one had read that book.
hi: विद्यार्थियों में से केवल एक ही ने किताब को पढ़ा था।

source: I saw him go into the toilet a few minutes ago.
hi: मैंने उसे एक-दो मिनट पहले टॉयलेट में जाते हुए देखा था।

source: You'll be all right again in a couple of days.
hi: तुम दो तीन दिनों में फिरसे ठीक हो जाओगे।

source: May I ask a few questions?
hi: क्या मैं चंद सवाल पूछ सकती हूँ?

source: I cover twenty miles a day.
hi: मैं रोज़ बीस मील चलता हूँ।

source: It is next to impossible to see Rome in a day.
hi: रोम एक दिन में देखना असंभव है।

source: I must buy one.
hi: मुझे एक तो खरीदना ही होगा।

source: One lives in Fukuoka, and the others live in Niigata.
hi: एक फ़ुकुओका में रहता है, और बाकी निइगाता में रहते हैं।

source: A man appeared at the door.
hi: दरवाज़े पर एक आदमी दिखाई दिया।

source: Let's get together here once a week.
hi: हमे यहाँ हफ़्ते में एक बार मिलना चाहिए।

source: Exports in January were up 20% over the same period of last year.
hi: पिछले जनवरी के मुकाबले इस साल निर्यात २० प्रतिशत बढ़ा.

source: The 1990s began with the Gulf War.
hi: १९९० के दशक की शुरुआत खाड़ी युद्ध से शुरू हुई।

source: In 1951, Sister Teresa was sent to Calcutta, then the largest city in India.
hi: १९५१ में सिस्टर टेरेसा को कलकत्ता भेजा गया था, जो उस समय भारत का सबसे बड़ा शहर था।

source: I learned to drive a car and got a driver's license when I was eighteen.
hi: जब मैं अठारह साल का था मैंने गाड़ी चलानी सीखी और लाईसेंस बनवालिया।

source: In the 1600s, tea was introduced into Europe from India.
hi: १६०० की शतक में चाय को भारत से यूरोप में लाया गया था।

source: I'm catching the 11:00 train.
hi: मैं ग्यारह बजे की ट्रेन पकड़ रहा हूँ।

source: Ten years is a long time.
hi: दस साल बहुत लम्बा समय होता है।

source: You must be back by 10 o'clock.
hi: तुम्हे दस बजे तक वापस आ जाना होगा।

source: I'll be back at ten.
hi: मैं दस बजे वापस आऊँगा।

source: Ten houses were burned down.
hi: दस घर जलकर राख हो गए।

source: One billion people speak English.
hi: सौ अरब लोग अंग्रेज़ी बोलते हैं।

source: I don't want to spend more than $10.
hi: मैं दस डॉलर से ज़्यादा नहीं खर्चना चाह्ता हूँ।

source: What do you mean by cultural relativism?
hi: सांस्कृतिक सापेक्षवाद से आपका क्या मतलब है?

source: "Road under Repair."
hi: "सड़क की मरम्मत जारी है।"

source: She said to herself, "I am very happy."
hi: उसने अपने आप से कहा: "मैं बहुत खुश हूँ"

source: The teacher said, "That's all for today."
hi: टीचर ने कहा, "बस आज के लिए इतना ही।"

source: "Get rid of it, of course!" answered the farmer.
hi: "बिलकुल, उसको फैंक दो!" किसान ने जवाब दिया.

source: "Who is it?" "It's me."
hi: "कौन है?" "मैं हूँ"

source: "What shall I do?" I said to myself.
hi: "क्या करूँ?" मैंने अपने-आप से पूछा।

source: "Will they go on strike again?" "I'm afraid so."
hi: "वे फिरसे हड़ताल कर सकते हैं क्या?" "लगता तो ऐसा ही है।"

source: "Where do you live?" "I live in Tokyo."
hi: "आप कहाँ रहते हैं?" "मैं टोक्यो में रहता हूँ"

source: "You are Israel's teacher," said Jesus.
hi: "तुम इज़राइल के शिक्षक हो," यीशु ने कहाँ।

source: Spain has been a democracy since 1975.
hi: स्पेन १९७५ से जनतंत्र रहा है।

source: Welcome.
hi: आपका स्वागत है।

source: The trees are green.
hi: पेड़ हरे हैं।

source: I have no interest in ordinary people.
hi: मुझे साधारण लोगों में कोई दिलचस्पी नहीं है।

source: You are not coming, are you?
hi: तुम नहीं आ रहे हो ना?

source: Will you go by train?
hi: तुम रेलगाड़ी से जाओगे क्या?

source: I'll make you happy.
hi: मैं तुम्हें खुश करूँगा।

source: It's up to me whether I kill you or let you live!
hi: तुम्हें जीने दूँ या मरने दूँ, यह मेरे ऊपर है।

source: I am counting on you.
hi: मैं तुमपर भरोसा कर रहा हूँ।

source: I can't live without you.
hi: मैं तुम्हारे बिना जी नहीं सकता।

source: The soldier became a teacher.
hi: सैनिक बन गया शिक्षक।

source: The army has advanced to the river.
hi: सेना नदी तक बढ़ चुकी है।

source: My brother would often stay up all night.
hi: मेरा भाई अक्सर पूरी रात जागे रहता था।

source: The police were patrolling the street.
hi: पुलिस ने सड़क पर पहरा लगा दिया था।

source: It will be dark by the time the police come here.
hi: पुलीस यहां आने तक अँधेरा हो गया होगा।

source: The police are after me.
hi: पुलीस मेरे पीछे पड़ें हैं।

source: The police still can't point out who committed the crime.
hi: पुलिस को अब तक इस बात की जानकारी नहीं है कि जुर्म किसने किया है।

source: The police arrested the man who had murdered the girl.
hi: पुलिस ने उस लड़की के क़ातिल को हरासत में ले लिया।

source: A police officer is talking to her.
hi: एक पुलिस अफ़सर उससे बात कर रहा है।

source: Policemen work at the risk of their own lives.
hi: पुलिस अफ़सर अपनी जानों को जोखिम में डालकर काम करते हैं।

source: The shooting started around noon.
hi: गोलीबारी लगभग दोपहर के बारह बजे शुरू हुई।

source: Never speak ill of others.
hi: दूसरों की बुराई कभी नहीं करनी चाहिए।

source: It will not be long before we know the result.
hi: नतीजा जानने में अब ज़्यादा देर नहीं लगेगी।

source: You should hand in your report to me on Monday.
hi: तुम्हे अपनी रिपोर्ट मुझे सोमवार को सौंप देनी चाहिए।

source: Ken has not washed the car yet.
hi: केन ने अभी तक गाड़ी नहीं धोई है।

source: Ken is tall, but I'm not.
hi: केन ऊंचा है, मगर मैं नहीं।

source: Ken went to the park to meet Yumi.
hi: केन यूमी से मिलने पार्क में गया।

source: Who runs faster, Ken or Tony?
hi: कौन ज़्यादा तेज़ भागता है, केन या टोनी?

source: It is not till we lose our health that we realize its true value.
hi: हम जब तक अपना स्वास्थ्य नहीं खो देते हैं तब तक उसकी असली कीमत नहीं पहचानते हैं।

source: International trade is vital for healthy economies.
hi: अंतर्राष्ट्रीय व्यापार मज़बूत अर्थव्यवस्था के लिए आवश्यक है।

source: Kenji decided to become a cook.
hi: केन्जी ने बावर्ची बनने का निर्णय किया।

source: Kenji told his friends a story about his trip to India.
hi: केनजी ने उसके दोस्तों को उसके भारत के सफ़र की कहानी सुनाई।

source: Fighting won't settle anything.
hi: लड़ने-झगड़ने से बात का हल नहीं होगा।

source: Some people want to amend the constitution.
hi: कुछ लोग संविधान को सुधारना चाहते हैं।

source: You had better chain up the dog so that he won't bite.
hi: तुम्हें कुत्ते को बांध देना चाहिए जिससे कि वह किसी को काट न ले।

source: Dogs can swim.
hi: कुत्ते तैर सकते हैं।

source: You keep a dog, don't you?
hi: तुम्हारे पास एक कुत्ता है, है न?

source: It appears that he is honest.
hi: वह ईमानदार लगता है।

source: Look! The book is burning.
hi: देखो! किताब को आग लग गई है।

source: I'm disappointed with you.
hi: मैं तुमसे निराश हूँ।

source: A strange man came up to us.
hi: एक अजीब आदमी हमारे सामने आया।

source: Learn humility.
hi: नम्रता सीखो।

source: Good luck.
hi: शुभ कामनाएँ।

source: There is a strange man at the door.
hi: दरवाज़े पर कोई अजीब सा इनसान है।

source: Haven't you gone too far?
hi: क्या तुम कुछ अधिक नहीं बोल गए?

source: Saying and doing are two different things.
hi: कहने और करने में बड़ा अंतर है।

source: Talking is one thing, doing is another.
hi: बोलने और करने में फ़र्क होता है।

source: To say is one thing, and to do is another.
hi: कथनी और करनी में अंतर होता है.

source: Don't tell me.
hi: मत बताओ।

source: Watch your language.
hi: ज़बान सम्भाल के बात करो।

source: As the saying goes, "Nothing ventured, nothing gained."
hi: एक कहावत है, "कुछ पाने के लिए कुछ खोना पड़ता है"।

source: The ancient Romans founded colonies throughout Europe.
hi: प्राचीन रोमवासी यूरोप में हर जगह उपनिवेश स्थापित करते थे।

source: The lake is deep here.
hi: झील यहाँ पर बहुत गहरी है।

source: Will it rain this afternoon?
hi: क्या इस दोपहर बारिश होगी?

source: It is going to rain this afternoon.
hi: आज दोपहर बारिश होने वाली है।

source: I'm gonna have to call you back.
hi: मुझे तुम्हें वापस बुलाना पड़ेगा।

source: Speak louder for the benefit of those in the rear.
hi: पीछे बैठे हुए लोगों के लिए थोड़ी ऊँची आवाज़ में बोलो।

source: Let me congratulate you on your engagement.
hi: आपको आपकी सगाई पर बहुत बहुत बधाईंयाँ।

source: Give me your attention, please.
hi: कृपया ध्यान दीजिए।

source: You don't have to cover your mistake.
hi: तुम्हे अपनी गलती छिपाने की ज़रूरत नहीं है।

source: I was caught in a traffic jam.
hi: मैं ट्राफ़िक जाम में फँस गया था।

source: Let's keep public places clean.
hi: हमें सार्वजनिक स्थानों को स्वच्छ रखना चाहिए।

source: Whatever happens, I'll not tell anybody about it.
hi: मैं किसी को भी नहीं बाताऊँगा, चाहे जो भी हो।

source: You will play into their hands.
hi: तुम उनके जाल में फँस जाओगे।

source: Put it where you like.
hi: जहाँ भी डालना है डालदो।

source: She said that she was happy.
hi: उसने कहा कि वह खुश थी।

source: Hiroki was at a loss what to do.
hi: हिरोको को समझ नहीं आ रहा था कि वह क्या करे.

source: Two teas and a coffee, please.
hi: दो चाय और एक कॉफ़ी दीजिए।

source: I want another cup of tea.
hi: मुझे और एक कप चाय चाहिए।

source: Some like tea, others prefer coffee.
hi: कुछ लोगों को चाय अच्छी लगती है, और कुछ लोगों को कॉफ़ी।

source: Think about it.
hi: सोच लो।

source: Let's go!
hi: चलो चलें!

source: The king was deprived of his power.
hi: उस राजा से उसकी ताक़त छीन ली गई।

source: The people deprived him of his rights.
hi: लोगों ने उस से उसके हकों को छीन लिया.

source: Black becomes you.
hi: काला रंग तुम पर जँचता है।

source: Dark clouds were brooding over the city.
hi: शहर के ऊपर काले बादल छा रहे थे।

source: I have little money now.
hi: अब मेरे पास बहुत थोड़े पैसे हैं।

source: Nothing but a miracle can save her now.
hi: अब तो उसे कोई चमत्कार ही बचा सकता है।

source: He is walking now.
hi: वह अब चल रहा है।

source: I'm satisfied with my current income.
hi: मैं अपनी कमाई से संतुष्ट हूँ।

source: He's out of town on business.
hi: वे काम से शहर से बाहर गए हुएँ हैं।

source: He'll become a good husband.
hi: वह एक अच्छा पती बनेगा।

source: I don't feel like eating now.
hi: मुझे अभी खाना खाने का मन नहीं है।

source: I can't make it this time.
hi: मैं इस बार नहीं आ सकता।

source: There were two murders this month.
hi: इस महीने दो क़त्ल हुए हैं।

source: I wish I were young.
hi: काश मैं जवान होता!

source: What movies are playing this week?
hi: इस सप्ताह कौन सी फ़िल्में लगीं हुईं हैं?

source: I'm at Narita Airport right now.
hi: मैं इस वक़्त नारिता हवाई अड्डे पर हूँ।

source: Did you feel the earthquake this morning?
hi: तुम्हें आज सुबह भूकम्प महसूस हुआ क्या?

source: This morning the weather was so bad that I had to take a taxi.
hi: आज सुबह मौसम इतना खराब था कि मुझे टैक्सी लेनी पड़ी।

source: I leave here at ten-thirty next Sunday.
hi: मैं यहाँ से अगले रविवार को साढ़े दस बजे निकल जाऊँगा।

source: Will you take us for a drive next Sunday?
hi: हमें अगले हफ़्ते ड्राईव पर लेजाओगे क्या?

source: Bring your sister next time.
hi: अगली बार अपनी बहन को भी साथ लाना।

source: Are you busy today?
hi: तुम आज बिज़ी हो क्या?

source: I don't think I shall get through all this work this afternoon.
hi: मुझे नहीं लगता मैं इतना सारा काम इस दोपहर को खतम कर पाऊँगा।

source: Today's minimum temperature was 3 °C.
hi: आज का न्यूनतम तापमान तीन डिग्री सेल्सियस था।

source: I've not read today's paper yet.
hi: मैंने अभी तक आज का अखबार नहीं पढ़ा है।

source: Bring me today's paper, please.
hi: कृपया मेरे लिए आज का अख़बार लाना।

source: His behavior is very odd today.
hi: उसका बर्ताव आज बहुत अजीब है।

source: Today is my sister's birthday.
hi: आज मेरी बहन का जन्मदिन है।

source: I have a lot of work to get through today.
hi: मेरे पास आज बहुत काम है।

source: I'm lucky today.
hi: आज मेरा नसीब अच्छा है।

source: What seems to be the problem today?
hi: आज क्या समस्या है ?

source: It is very cold today, isn't it?
hi: आज बहुत ठंडा है ना?

source: Apples were on sale today.
hi: आज सेव सस्ते बिक रहे थे।

source: I don't feel like studying English today.
hi: मेरा आज अंग्रेज़ी पढ़ने का मन नहीं है।

source: What's the day today?
hi: आज कौनसा दिन है?

source: Instead of cleaning the house today, I think I'll take a walk.
hi: मैं आज घर साफ़ करने के बजाय सैर करने जाऊँगी।

source: I'm in a hurry today.
hi: मैं आज जल्दी में हूँ।

source: Today is my sixteenth birthday.
hi: आज मेरा सोलहवा जन्मदिन है।

source: Let's let the workers go home early today.
hi: आज कर्मचारियों को थोड़ा जल्दी घर जाने देते हैं।

source: It's hot today.
hi: आज मौसम बहुत गरम है।

source: It's rather cold today.
hi: आज मौसम काफ़ी ठंडा है।

source: Is anyone absent today?
hi: क्या आज कोई अनुपस्थित है?

source: It is essential to have good command of English nowadays.
hi: आजकल अंग्रेज़ी अच्छे से बोलना जानना बहुत ज़रूरी है।

source: It isn't raining much this year.
hi: इस साल ज़्यादा बारिश नहीं हो रही है।

source: I'll call him tonight.
hi: आज रात को मैं उसे फ़ोन करूँगा।

source: I have no place to sleep tonight.
hi: मेरे पास आज रात सोने के लिए जगह नहीं है।

source: Will you go to the party tonight?
hi: तुम आज रात पार्टी में जाओगे क्या?

source: The trouble is that they have no time.
hi: मुश्किल यह है कि उनके पास समय नहीं है।

source: Drop me a line when you are in trouble.
hi: अगर कोई भी दिक्कत हो तो मुझसे कहना।

source: Turning to the left, you will find the post office.
hi: बाईं तरफ़ को मुड़ोगे तो तुम्हें डाक घर नज़र आएगा।

source: Add a little sugar and cream.
hi: थोड़ी शक़्क़र और मलाई डालो।

source: Don't confuse sugar with salt.
hi: शक्कर को नमक मत समझ बैठो।

source: Sugar dissolves in hot coffee.
hi: चीनी गरम कॉफ़ी में घुल जाती है।

source: Few students use pencils these days.
hi: आजकल बहुत कम विद्यार्थी पेनसिल इस्तेमाल करतें हैं।

source: Could I be going soft in the head? I forget things so easily these days.
hi: शायद मैं सटिया गया हूँ। आजकल चीज़ें इतनी आसानी से भूल जाता हूँ।

source: I haven't seen Tom lately.
hi: मैंने टॉम को हाल में नहीं देखा है।

source: Nowadays nobody believes in ghosts.
hi: आजकल कोई भी भूत-प्रेत में विश्वास नहीं करता।

source: We haven't seen her of late.
hi: हमने उसे हाल ही में देखा नहीं हैं।

source: Whoever comes first will get the best seats.
hi: जो भी पहले आएँगे उन्हें सबसे अच्छी सीटें मिलेंगीं।

source: My wife has just cleared the table.
hi: मेरी बीवी ने अभी-अभी मेज़ को साफ़ किया है।

source: Much as I admire him as a writer, I don't like him as a man.
hi: मैं लेखक के तौर पर उनका आदर करता हूँ, पर इनसान के तौर पर उन्हें पसंद नहीं करता।

source: Workers must have their hair cut short.
hi: कर्मचारियों को अपने बाल छोटे कटाने होते हैं।

source: The bat was stolen yesterday, along with the balls.
hi: बैट और बॉल दोनो कल एकसाथ चोरी हो गए।

source: A big earthquake occurred in India yesterday.
hi: भारत में कल एक बड़ा भूकम्प हुआ था।

source: I met Ken yesterday.
hi: मेरी केन से कल मुलाकात हुई थी।

source: If only I had known the answer yesterday!
hi: काश मुझे यह जवाब कल पता होता!

source: Only yesterday did I know the fact.
hi: मुझे कल ही असलियत का पता चला।

source: How did Barbara do on her driver's test yesterday?
hi: कल बारबरा की गाड़ी चलाने की परीक्षा कैसी गई?

source: Yesterday was my birthday.
hi: कल मेरा जन्मदिन था।

source: There weren't any children in the park yesterday.
hi: कल पार्क में एक भी बच्चा नहीं था।

source: The water was cut off yesterday.
hi: पानी कल बंद हो गया था।

source: It was Tom that broke the window yesterday.
hi: कल जिसने खिड़की तोड़ी थी वह टॉम था।

source: Yesterday we went into a huge maze.
hi: कल हम एक बड़े से भूलभुलैया में गए थे।

source: I had a letter from her yesterday.
hi: मेरे पास कल उसकी एक चिट्ठी आई।

source: I bought a book yesterday.
hi: मैंने कल एक किताब खरीदी थी।

source: You should have come yesterday.
hi: तुम्हे कल आना चाहिए था।

source: I wrote a love letter last night.
hi: मैंने कल रात एक प्रेम पत्र लिखा था।

source: Last night I was caught in a shower and got wet to the skin.
hi: कल रात मैं बारिश में फंस गया और तर तर भीग गया।

source: What happened last night?
hi: कल रात क्या हुआ?

source: It was raining last night.
hi: कल रात बारिश हो रही थी।

source: We had heavy rainfall last night.
hi: हमारे यहाँ कल रात भारी बरसात हुई थी।

source: It has been raining for three days on end.
hi: लगातार तीन दिनों से बारिश हो रही है।

source: Mr. and Mrs. Yamada will come home next month.
hi: श्रिमान और श्रिमती यामादा अगले महीने घर आएंगे।

source: I fear so.
hi: खेद की बात है, लेकिन वैसा ही है।

source: It's April first.
hi: आज एक अप्रैल है।

source: My sister always keeps her room clean.
hi: मेरी बहन अपने कमरे को हमेशा साफ़-सुथरा रखती है।

source: My sister likes sweets.
hi: मेरी बहन को मिठाईयाँ पसंद हैं।

source: It is dangerous for children to play in the street.
hi: रास्ते पर खेलना बच्चों के लिये खतरनाक होता है।

source: One must be patient with children.
hi: बच्चों के साथ हमें सहनशीलता से पेश आना चाहिए।

source: The children tried to imitate their teacher.
hi: बच्चों ने एक-दूसरे की नकल करने की कोशिश करी।

source: Children love playing on the beach.
hi: बच्चों को समुद्रतट पर खेलना बहुत पसंद आता है।

source: I took the children to school.
hi: मैं बच्चों को स्कूल ले गया।

source: Keep children away from medicine.
hi: बच्चों को दवाईयों से दूर रखना चहिए।

source: Even children can understand it.
hi: इस बात को बच्चे भी समझते हैं।

source: I always got up early in my childhood.
hi: जब मैं छोटा था मैं हमेशा जल्दी सोकर उठा करता था।

source: The child must be taught to respect the truth and to tell the truth.
hi: इस बच्चे को सच का आदर और सच का पालन करना सिखाना होगा।

source: Children are to obey their parents.
hi: बच्चों को माँ-बाप की बात माननी चाहिए।

source: The children were flying kites.
hi: बच्चे पतंग उड़ा रहे थे।

source: The children are at play in the garden.
hi: बच्चे बगीचे में खेल रहे हैं।

source: The market is held every Monday.
hi: वह बाज़ार हर सोमवार को लगता है।

source: I'd like a map of the city.
hi: मैं शहर का नक्शा खरीदना चाहता हूँ।

source: I'd like a city map.
hi: मुझे शहर का नक्शा चाहिए।

source: I just cut my finger.
hi: मैंने अपनी ऊँगली काट ली।
